TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_i2c.h
/*****************************************************************************

  Copyright (C) 2023 Texas Instruments Incorporated - http://www.ti.com/

  Redistribution and use in source and binary forms, with or without
  modification, are permitted provided that the following conditions
  are met:

   Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_i2c__include
#define ti_devices_msp_peripherals_hw_i2c__include

/* Filename: hw_i2c.h */
/* Revised: 2023-06-14 10:18:34 */
/* Revision: 638bba738cb61945408cf5e8bcfecf08798f4b8b */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* I2C Registers
******************************************************************************/
#define I2C_SLAVE_OFS                            ((uint32_t)0x00001250U)
#define I2C_MASTER_OFS                           ((uint32_t)0x00001210U)
#define I2C_DMA_TRIG0_OFS                        ((uint32_t)0x00001080U)
#define I2C_DMA_TRIG1_OFS                        ((uint32_t)0x00001050U)
#define I2C_CPU_INT_OFS                          ((uint32_t)0x00001020U)
#define I2C_GPRCM_OFS                            ((uint32_t)0x00000800U)


/** @addtogroup I2C_SLAVE
  @{
*/

typedef struct {
  __IO uint32_t SOAR;                              /* !< (@ 0x00001250) I2C Target Own Address */
  __IO uint32_t SOAR2;                             /* !< (@ 0x00001254) I2C Target Own Address 2 */
  __IO uint32_t SCTR;                              /* !< (@ 0x00001258) I2C Target Control Register */
  __I  uint32_t SSR;                               /* !< (@ 0x0000125C) I2C Target Status Register */
  __I  uint32_t SRXDATA;                           /* !< (@ 0x00001260) I2C Target RXData */
  __IO uint32_t STXDATA;                           /* !< (@ 0x00001264) I2C Target TXData */
  __IO uint32_t SACKCTL;                           /* !< (@ 0x00001268) I2C Target ACK Control */
  __IO uint32_t SFIFOCTL;                          /* !< (@ 0x0000126C) I2C Target FIFO Control */
  __I  uint32_t SFIFOSR;                           /* !< (@ 0x00001270) I2C Target FIFO Status Register */
  __IO uint32_t TARGET_PECCTL;                     /* !< (@ 0x00001274) I2C Target PEC control register */
  __I  uint32_t TARGET_PECSR;                      /* !< (@ 0x00001278) I2C Target PEC status register */
} I2C_SLAVE_Regs;

/*@}*/ /* end of group I2C_SLAVE */

/** @addtogroup I2C_MASTER
  @{
*/

typedef struct {
  __IO uint32_t MSA;                               /* !< (@ 0x00001210) I2C Controller Target Address Register */
  __IO uint32_t MCTR;                              /* !< (@ 0x00001214) I2C Controller Control Register */
  __I  uint32_t MSR;                               /* !< (@ 0x00001218) I2C Controller Status Register */
  __I  uint32_t MRXDATA;                           /* !< (@ 0x0000121C) I2C Controller RXData */
  __IO uint32_t MTXDATA;                           /* !< (@ 0x00001220) I2C Controller TXData */
  __IO uint32_t MTPR;                              /* !< (@ 0x00001224) I2C Controller Timer Period */
  __IO uint32_t MCR;                               /* !< (@ 0x00001228) I2C Controller Configuration */
       uint32_t RESERVED0[2];
  __I  uint32_t MBMON;                             /* !< (@ 0x00001234) I2C Controller Bus Monitor */
  __IO uint32_t MFIFOCTL;                          /* !< (@ 0x00001238) I2C Controller FIFO Control */
  __I  uint32_t MFIFOSR;                           /* !< (@ 0x0000123C) I2C Controller FIFO Status Register */
  __IO uint32_t CONTROLLER_I2CPECCTL;              /* !< (@ 0x00001240) I2C Controller PEC control register */
  __I  uint32_t CONTROLLER_PECSR;                  /* !< (@ 0x00001244) I2C Controller PEC status register */
} I2C_MASTER_Regs;

/*@}*/ /* end of group I2C_MASTER */

/** @addtogroup I2C_DMA_TRIG0
  @{
*/

