TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_i2c.h
/* I2C_SCTR Bits */
/* I2C_SCTR[ACTIVE] Bits */
#define I2C_SCTR_ACTIVE_OFS                      (0)                             /* !< ACTIVE Offset */
#define I2C_SCTR_ACTIVE_MASK                     ((uint32_t)0x00000001U)         /* !< Device Active. Setting this bit
                                                                                    enables the Target functionality. */
#define I2C_SCTR_ACTIVE_DISABLE                  ((uint32_t)0x00000000U)         /* !< Disables the I2C Target operation. */
#define I2C_SCTR_ACTIVE_ENABLE                   ((uint32_t)0x00000001U)         /* !< Enables the I2C Target operation. */
/* I2C_SCTR[GENCALL] Bits */
#define I2C_SCTR_GENCALL_OFS                     (1)                             /* !< GENCALL Offset */
#define I2C_SCTR_GENCALL_MASK                    ((uint32_t)0x00000002U)         /* !< General call response enable Modify
                                                                                    only when UCSWRST = 1. 0b = Do not
                                                                                    respond to a general call 1b =
                                                                                    Respond to a general call */
#define I2C_SCTR_GENCALL_DISABLE                 ((uint32_t)0x00000000U)         /* !< Do not respond to a general call */
#define I2C_SCTR_GENCALL_ENABLE                  ((uint32_t)0x00000002U)         /* !< Respond to a general call */
/* I2C_SCTR[SCLKSTRETCH] Bits */
#define I2C_SCTR_SCLKSTRETCH_OFS                 (2)                             /* !< SCLKSTRETCH Offset */
#define I2C_SCTR_SCLKSTRETCH_MASK                ((uint32_t)0x00000004U)         /* !< Target Clock Stretch Enable */
#define I2C_SCTR_SCLKSTRETCH_DISABLE             ((uint32_t)0x00000000U)         /* !< Target clock stretching is disabled */
#define I2C_SCTR_SCLKSTRETCH_ENABLE              ((uint32_t)0x00000004U)         /* !< Target clock stretching is enabled */
/* I2C_SCTR[TXEMPTY_ON_TREQ] Bits */
#define I2C_SCTR_TXEMPTY_ON_TREQ_OFS             (3)                             /* !< TXEMPTY_ON_TREQ Offset */
#define I2C_SCTR_TXEMPTY_ON_TREQ_MASK            ((uint32_t)0x00000008U)         /* !< Tx Empty Interrupt on TREQ */
#define I2C_SCTR_TXEMPTY_ON_TREQ_DISABLE         ((uint32_t)0x00000000U)         /* !< When 0, RIS:STXEMPTY will be set
                                                                                    when only the Target TX FIFO is
                                                                                    empty. This allows the STXEMPTY
                                                                                    interrupt to be used to indicate that
                                                                                    the I2C bus is being clock stretched
                                                                                    and that Target TX data is required. */
#define I2C_SCTR_TXEMPTY_ON_TREQ_ENABLE          ((uint32_t)0x00000008U)         /* !< When 1, RIS:STXEMPTY will be set
                                                                                    when the Target State Machine is in
                                                                                    the TX_WAIT state which occurs when
                                                                                    the TX FIFO is empty AND the I2C
                                                                                    transaction is clock stretched
                                                                                    waiting for the FIFO to receive data. */
/* I2C_SCTR[TXTRIG_TXMODE] Bits */
#define I2C_SCTR_TXTRIG_TXMODE_OFS               (4)                             /* !< TXTRIG_TXMODE Offset */
#define I2C_SCTR_TXTRIG_TXMODE_MASK              ((uint32_t)0x00000010U)         /* !< Tx Trigger when Target FSM is in Tx
                                                                                    Mode */
#define I2C_SCTR_TXTRIG_TXMODE_DISABLE           ((uint32_t)0x00000000U)         /* !< No special behavior */
#define I2C_SCTR_TXTRIG_TXMODE_ENABLE            ((uint32_t)0x00000010U)         /* !< When 1, RIS:TXFIFOTRG will be set
                                                                                    when the Target TX FIFO has reached
                                                                                    the trigger level AND the Target
                                                                                    State Machine is in the TXMODE as
                                                                                    defined in the SSR register. When
                                                                                    cleared RIS:TXFIFOTRG will be set
                                                                                    when the Target TX FIFO is at or
                                                                                    above the trigger level. This setting
                                                                                    can be used to hold off the TX DMA
                                                                                    until a transaction starts. This
                                                                                    allows the DMA to be configured when
                                                                                    the I2C is idle but have it wait till
                                                                                    the transaction starts to load the
                                                                                    Target TX FIFO, so it can load from a
                                                                                    memory buffer that might be changing
                                                                                    over time. */
/* I2C_SCTR[TXWAIT_STALE_TXFIFO] Bits */
#define I2C_SCTR_TXWAIT_STALE_TXFIFO_OFS         (5)                             /* !< TXWAIT_STALE_TXFIFO Offset */
#define I2C_SCTR_TXWAIT_STALE_TXFIFO_MASK        ((uint32_t)0x00000020U)         /* !< Tx transfer waits when stale data
                                                                                    in Tx FIFO. This prevents stale bytes
                                                                                    left in the TX FIFO from
                                                                                    automatically being sent on the next
                                                                                    I2C packet. Note: this should be used
                                                                                    with TXEMPTY_ON_TREQ set to prevent
                                                                                    the Target State Machine from waiting
                                                                                    for TX FIFO data without an interrupt
                                                                                    notification when the FIFO data is
                                                                                    stale. */
#define I2C_SCTR_TXWAIT_STALE_TXFIFO_DISABLE     ((uint32_t)0x00000000U)         /* !< When 0, the TX FIFO empty signal to
                                                                                    the Target State Machine indicates
                                                                                    that the TX FIFO is empty. */
#define I2C_SCTR_TXWAIT_STALE_TXFIFO_ENABLE      ((uint32_t)0x00000020U)         /* !< When 1, the TX FIFO empty signal to
                                                                                    the Target State Machine will
                                                                                    indicate that the TX FIFO is empty or
                                                                                    that the TX FIFO data is stale. The
                                                                                    TX FIFO data is determined to be
                                                                                    stale when there is data in the TX
                                                                                    FIFO when the Target State Machine
                                                                                    leaves the TXMODE as defined in the
                                                                                    SSR register. This can occur is a
                                                                                    Stop or timeout occur when there are
                                                                                    bytes left in the TX FIFO. */
/* I2C_SCTR[RXFULL_ON_RREQ] Bits */
#define I2C_SCTR_RXFULL_ON_RREQ_OFS              (6)                             /* !< RXFULL_ON_RREQ Offset */
#define I2C_SCTR_RXFULL_ON_RREQ_MASK             ((uint32_t)0x00000040U)         /* !< Rx full interrupt generated on RREQ
                                                                                    condition as indicated in SSR */
#define I2C_SCTR_RXFULL_ON_RREQ_DISABLE          ((uint32_t)0x00000000U)         /* !< When 0, RIS:SRXFULL will be set
                                                                                    when only the Target RX FIFO is full.
                                                                                    This allows the SRXFULL interrupt to
                                                                                    be used to indicate that the I2C bus
                                                                                    is being clock stretched and that the
                                                                                    FW must either read the RX FIFO or
                                                                                    ACK/NACK the current Rx byte. */
#define I2C_SCTR_RXFULL_ON_RREQ_ENABLE           ((uint32_t)0x00000040U)         /* !< When 1, RIS:SRXFULL will be set
                                                                                    when the Target State Machine is in
                                                                                    the RX_WAIT or RX_ACK_WAIT states
                                                                                    which occurs when the I2C transaction
                                                                                    is clock stretched because the RX
                                                                                    FIFO is full or the ACKOEN has been
                                                                                    set and the state machine is waiting
                                                                                    for FW to ACK/NACK the current byte. */
/* I2C_SCTR[EN_DEFHOSTADR] Bits */
#define I2C_SCTR_EN_DEFHOSTADR_OFS               (7)                             /* !< EN_DEFHOSTADR Offset */
#define I2C_SCTR_EN_DEFHOSTADR_MASK              ((uint32_t)0x00000080U)         /* !< Enable Default Host Address */
#define I2C_SCTR_EN_DEFHOSTADR_DISABLE           ((uint32_t)0x00000000U)         /* !< When this bit is 0, the default
                                                                                    host address is not matched NOTE: it
                                                                                    may still be matched if programmed
                                                                                    inside SOAR/SOAR2 */
#define I2C_SCTR_EN_DEFHOSTADR_ENABLE            ((uint32_t)0x00000080U)         /* !< When this bit is 1, default host
                                                                                    address of 7h000_1000 is always
                                                                                    matched by the Target address match
                                                                                    logic. */
/* I2C_SCTR[EN_ALRESPADR] Bits */
#define I2C_SCTR_EN_ALRESPADR_OFS                (8)                             /* !< EN_ALRESPADR Offset */
#define I2C_SCTR_EN_ALRESPADR_MASK               ((uint32_t)0x00000100U)         /* !< Enable Alert Response Address */
#define I2C_SCTR_EN_ALRESPADR_DISABLE            ((uint32_t)0x00000000U)         /* !< When this bit is 0, the alert
                                                                                    response address is not matched.
                                                                                    NOTE: it may still be matched if
                                                                                    programmed inside SOAR/SOAR2 */
#define I2C_SCTR_EN_ALRESPADR_ENABLE             ((uint32_t)0x00000100U)         /* !< When this bit is 1, alert response
                                                                                    address of 7h000_1100 is always
                                                                                    matched by the Target address match
                                                                                    logic. */
/* I2C_SCTR[EN_DEFDEVADR] Bits */
#define I2C_SCTR_EN_DEFDEVADR_OFS                (9)                             /* !< EN_DEFDEVADR Offset */
#define I2C_SCTR_EN_DEFDEVADR_MASK               ((uint32_t)0x00000200U)         /* !< Enable Deault device address */
#define I2C_SCTR_EN_DEFDEVADR_DISABLE            ((uint32_t)0x00000000U)         /* !< When this bit is 0, the default
                                                                                    device address is not matched. NOTE:
                                                                                    it may still be matched if programmed
                                                                                    inside SOAR/SOAR2. */
#define I2C_SCTR_EN_DEFDEVADR_ENABLE             ((uint32_t)0x00000200U)         /* !< When this bit is 1, default device
                                                                                    address of 7h110_0001 is always
                                                                                    matched by the Target address match
                                                                                    logic. */
/* I2C_SCTR[SWUEN] Bits */
#define I2C_SCTR_SWUEN_OFS                       (10)                            /* !< SWUEN Offset */
#define I2C_SCTR_SWUEN_MASK                      ((uint32_t)0x00000400U)         /* !< Target Wakeup Enable */
#define I2C_SCTR_SWUEN_DISABLE                   ((uint32_t)0x00000000U)         /* !< When 0, the Target is not allowed
                                                                                    to clock stretch on START detection */
#define I2C_SCTR_SWUEN_ENABLE                    ((uint32_t)0x00000400U)         /* !< When 1, the Target is allowed to
                                                                                    clock stretch on START detection and
                                                                                    wait for faster clock to be
                                                                                    abvailable. This allows clean wake up
                                                                                    support for I2C in low power mode use
                                                                                    cases */

