TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_i2c.h
/* I2C_SFIFOCTL Bits */
/* I2C_SFIFOCTL[TXTRIG] Bits */
#define I2C_SFIFOCTL_TXTRIG_OFS                  (0)                             /* !< TXTRIG Offset */
#define I2C_SFIFOCTL_TXTRIG_MASK                 ((uint32_t)0x00000007U)         /* !< TX FIFO Trigger Indicates at what
                                                                                    fill level in the TX FIFO a trigger
                                                                                    will be generated. */
#define I2C_SFIFOCTL_TXTRIG_LEVEL_4              ((uint32_t)0x00000004U)         /* !< Trigger when TX FIFO contains  4
                                                                                    byte */
#define I2C_SFIFOCTL_TXTRIG_LEVEL_5              ((uint32_t)0x00000005U)         /* !< Trigger when TX FIFO contains  5
                                                                                    byte */
#define I2C_SFIFOCTL_TXTRIG_LEVEL_6              ((uint32_t)0x00000006U)         /* !< Trigger when TX FIFO contains  6
                                                                                    byte */
#define I2C_SFIFOCTL_TXTRIG_LEVEL_7              ((uint32_t)0x00000007U)         /* !< Trigger when TX FIFO contains  7
                                                                                    byte */
/* I2C_SFIFOCTL[TXFLUSH] Bits */
#define I2C_SFIFOCTL_TXFLUSH_OFS                 (7)                             /* !< TXFLUSH Offset */
#define I2C_SFIFOCTL_TXFLUSH_MASK                ((uint32_t)0x00000080U)         /* !< TX FIFO Flush Setting this bit will
                                                                                    Flush the TX FIFO. Before clearing
                                                                                    this bit to stop Flush the TXFIFOCNT
                                                                                    should be checked to be 8 and
                                                                                    indicating that the Flush has
                                                                                    completed. */
#define I2C_SFIFOCTL_TXFLUSH_NOFLUSH             ((uint32_t)0x00000000U)         /* !< Do not Flush FIFO */
#define I2C_SFIFOCTL_TXFLUSH_FLUSH               ((uint32_t)0x00000080U)         /* !< Flush FIFO */
/* I2C_SFIFOCTL[RXFLUSH] Bits */
#define I2C_SFIFOCTL_RXFLUSH_OFS                 (15)                            /* !< RXFLUSH Offset */
#define I2C_SFIFOCTL_RXFLUSH_MASK                ((uint32_t)0x00008000U)         /* !< RX FIFO Flush Setting this bit will
                                                                                    Flush the RX FIFO. Before clearing
                                                                                    this bit to stop Flush the RXFIFOCNT
                                                                                    should be checked to be 0 and
                                                                                    indicating that the Flush has
                                                                                    completed. */
#define I2C_SFIFOCTL_RXFLUSH_NOFLUSH             ((uint32_t)0x00000000U)         /* !< Do not Flush FIFO */
#define I2C_SFIFOCTL_RXFLUSH_FLUSH               ((uint32_t)0x00008000U)         /* !< Flush FIFO */
/* I2C_SFIFOCTL[RXTRIG] Bits */
#define I2C_SFIFOCTL_RXTRIG_OFS                  (8)                             /* !< RXTRIG Offset */
#define I2C_SFIFOCTL_RXTRIG_MASK                 ((uint32_t)0x00000700U)         /* !< RX FIFO Trigger Indicates at what
                                                                                    fill level in the RX FIFO a trigger
                                                                                    will be generated. Note: Programming
                                                                                    RXTRIG to 0x0 has no effect since no
                                                                                    data is present to transfer out of RX
                                                                                    FIFO. */
#define I2C_SFIFOCTL_RXTRIG_LEVEL_5              ((uint32_t)0x00000400U)         /* !< Trigger when RX FIFO contains >= 5
                                                                                    byte */
#define I2C_SFIFOCTL_RXTRIG_LEVEL_6              ((uint32_t)0x00000500U)         /* !< Trigger when RX FIFO contains >= 6
                                                                                    byte */
#define I2C_SFIFOCTL_RXTRIG_LEVEL_7              ((uint32_t)0x00000600U)         /* !< Trigger when RX FIFO contains >= 7
                                                                                    byte */
#define I2C_SFIFOCTL_RXTRIG_LEVEL_8              ((uint32_t)0x00000700U)         /* !< Trigger when RX FIFO contains >= 8
                                                                                    byte */

/* I2C_SFIFOSR Bits */
/* I2C_SFIFOSR[RXFIFOCNT] Bits */
#define I2C_SFIFOSR_RXFIFOCNT_OFS                (0)                             /* !< RXFIFOCNT Offset */
#define I2C_SFIFOSR_RXFIFOCNT_MASK               ((uint32_t)0x0000000FU)         /* !< Number of Bytes which could be read
                                                                                    from the RX FIFO */
#define I2C_SFIFOSR_RXFIFOCNT_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_SFIFOSR_RXFIFOCNT_MAXIMUM            ((uint32_t)0x00000008U)         /* !< Highest possible value */
/* I2C_SFIFOSR[TXFIFOCNT] Bits */
#define I2C_SFIFOSR_TXFIFOCNT_OFS                (8)                             /* !< TXFIFOCNT Offset */
#define I2C_SFIFOSR_TXFIFOCNT_MASK               ((uint32_t)0x00000F00U)         /* !< Number of Bytes which could be put
                                                                                    into the TX FIFO */
#define I2C_SFIFOSR_TXFIFOCNT_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_SFIFOSR_TXFIFOCNT_MAXIMUM            ((uint32_t)0x00000800U)         /* !< Highest possible value */
/* I2C_SFIFOSR[TXFLUSH] Bits */
#define I2C_SFIFOSR_TXFLUSH_OFS                  (15)                            /* !< TXFLUSH Offset */
#define I2C_SFIFOSR_TXFLUSH_MASK                 ((uint32_t)0x00008000U)         /* !< TX FIFO Flush When this bit is set
                                                                                    a Flush operation for the TX FIFO is
                                                                                    active. Clear the TXFLUSH bit in the
                                                                                    control register to stop. */
#define I2C_SFIFOSR_TXFLUSH_INACTIVE             ((uint32_t)0x00000000U)         /* !< FIFO Flush not active */
#define I2C_SFIFOSR_TXFLUSH_ACTIVE               ((uint32_t)0x00008000U)         /* !< FIFO Flush active */
/* I2C_SFIFOSR[RXFLUSH] Bits */
#define I2C_SFIFOSR_RXFLUSH_OFS                  (7)                             /* !< RXFLUSH Offset */
#define I2C_SFIFOSR_RXFLUSH_MASK                 ((uint32_t)0x00000080U)         /* !< RX FIFO Flush When this bit is set
                                                                                    a Flush operation for the RX FIFO is
                                                                                    active. Clear the RXFLUSH bit in the
                                                                                    control register to stop. */
#define I2C_SFIFOSR_RXFLUSH_INACTIVE             ((uint32_t)0x00000000U)         /* !< FIFOFlush not active */
#define I2C_SFIFOSR_RXFLUSH_ACTIVE               ((uint32_t)0x00000080U)         /* !< FIFO Flush active */

/* I2C_TARGET_PECCTL Bits */
/* I2C_TARGET_PECCTL[PECCNT] Bits */
#define I2C_TARGET_PECCTL_PECCNT_OFS             (0)                             /* !< PECCNT Offset */
#define I2C_TARGET_PECCTL_PECCNT_MASK            ((uint32_t)0x000001FFU)         /* !< When this field is non zero, the
                                                                                    number of I2C data bytes are counted.
                                                                                    When the byte count = PECCNT and the
                                                                                    state machine is transmitting, the
                                                                                    contents of the LSFR is loaded into
                                                                                    the shift register instead of the
                                                                                    byte received from the Tx FIFO. When
                                                                                    the state machine is receiving, after
                                                                                    the last bit of this byte is received
                                                                                    the LSFR is checked and if it is
                                                                                    non-zero, a PEC RX Error interrupt is
                                                                                    generated. The I2C packet must be
                                                                                    padded to include the PEC byte for
                                                                                    both transmit and receive. In
                                                                                    transmit mode the FIFO must be loaded
                                                                                    with a dummy PEC byte. In receive
                                                                                    mode the PEC byte will be passed to
                                                                                    the Rx FIFO.  In the normal Target
                                                                                    use case, FW would set PECEN=1 and
                                                                                    PECCNT=0 and use the ACKOEN until the
                                                                                    remaining SMB packet length is known.
                                                                                    FW would then set the PECCNT to the
                                                                                    remaining packet length (Including
                                                                                    PEC bye). FW would then configure DMA
                                                                                    to allow the packet to complete
                                                                                    unassisted and exit NoAck mode.  Note
                                                                                    that when the byte count = PEC CNT,
                                                                                    the byte count is reset to 0 and
                                                                                    multiple PEC calculation can
                                                                                    automatically occur within a single
                                                                                    I2C transaction */
#define I2C_TARGET_PECCTL_PECCNT_MINIMUM         ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define I2C_TARGET_PECCTL_PECCNT_MAXIMUM         ((uint32_t)0x000001FFU)         /* !< Maximum Value */
/* I2C_TARGET_PECCTL[PECEN] Bits */
#define I2C_TARGET_PECCTL_PECEN_OFS              (12)                            /* !< PECEN Offset */
#define I2C_TARGET_PECCTL_PECEN_MASK             ((uint32_t)0x00001000U)         /* !< PEC Enable This bit enables the SMB
                                                                                    Packet Error Checking (PEC). When
                                                                                    enabled the PEC is calculated on all
                                                                                    bits except the Start, Stop, Ack and
                                                                                    Nack. The PEC LSFR and the Byte
                                                                                    Counter is set to 0 when the State
                                                                                    Machine is in the IDLE state, which
                                                                                    occur following a Stop or when a
                                                                                    timeout occurs. The Counter is also
                                                                                    set to 0 after the PEC byte is sent
                                                                                    or received. Note that the NACK is
                                                                                    automatically send following a PEC
                                                                                    byte that results in a PEC error. The
                                                                                    PEC Polynomial is x^8 + x^2 + x^1 +
                                                                                    1. */
#define I2C_TARGET_PECCTL_PECEN_DISABLE          ((uint32_t)0x00000000U)         /* !< PEC transmission and check is
                                                                                    disabled */
#define I2C_TARGET_PECCTL_PECEN_ENABLE           ((uint32_t)0x00001000U)         /* !< PEC transmission and check is
                                                                                    enabled */

/* I2C_TARGET_PECSR Bits */
/* I2C_TARGET_PECSR[PECBYTECNT] Bits */
#define I2C_TARGET_PECSR_PECBYTECNT_OFS          (0)                             /* !< PECBYTECNT Offset */
#define I2C_TARGET_PECSR_PECBYTECNT_MASK         ((uint32_t)0x000001FFU)         /* !< This is the current PEC Byte Count
                                                                                    of the Target State Machine. */
#define I2C_TARGET_PECSR_PECBYTECNT_MINIMUM      ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define I2C_TARGET_PECSR_PECBYTECNT_MAXIMUM      ((uint32_t)0x000001FFU)         /* !< Maximum Value */
/* I2C_TARGET_PECSR[PECSTS_CHECK] Bits */
#define I2C_TARGET_PECSR_PECSTS_CHECK_OFS        (16)                            /* !< PECSTS_CHECK Offset */
#define I2C_TARGET_PECSR_PECSTS_CHECK_MASK       ((uint32_t)0x00010000U)         /* !< This status bit indicates if the
                                                                                    PEC was checked in the transaction
                                                                                    that occurred before the last Stop.
                                                                                    Latched on Stop. */
#define I2C_TARGET_PECSR_PECSTS_CHECK_CLEARED    ((uint32_t)0x00000000U)         /* !< Indicates PEC was not checked in
                                                                                    the transaction that occurred before
                                                                                    the last Stop */
#define I2C_TARGET_PECSR_PECSTS_CHECK_SET        ((uint32_t)0x00010000U)         /* !< Indicates PEC was checked in the
                                                                                    transaction that occurred before the
                                                                                    last Stop */
/* I2C_TARGET_PECSR[PECSTS_ERROR] Bits */
#define I2C_TARGET_PECSR_PECSTS_ERROR_OFS        (17)                            /* !< PECSTS_ERROR Offset */
#define I2C_TARGET_PECSR_PECSTS_ERROR_MASK       ((uint32_t)0x00020000U)         /* !< This status bit indicates if a PEC
                                                                                    check error occurred in the
                                                                                    transaction that occurred before the
                                                                                    last Stop. Latched on Stop. */
#define I2C_TARGET_PECSR_PECSTS_ERROR_CLEARED    ((uint32_t)0x00000000U)         /* !< Indicates PEC check error did not
                                                                                    occurr in the transaction that
                                                                                    occurred before the last Stop */
#define I2C_TARGET_PECSR_PECSTS_ERROR_SET        ((uint32_t)0x00020000U)         /* !< Indicates PEC check error occurred
                                                                                    in the transaction that occurred
                                                                                    before the last Stop */

/* I2C_MSA Bits */
/* I2C_MSA[DIR] Bits */
#define I2C_MSA_DIR_OFS                          (0)                             /* !< DIR Offset */
#define I2C_MSA_DIR_MASK                         ((uint32_t)0x00000001U)         /* !< Receive/Send The DIR bit specifies
                                                                                    if the next Controller operation is a
                                                                                    Receive (High) or Transmit (Low). 0h
                                                                                    = Transmit 1h = Receive */
#define I2C_MSA_DIR_TRANSMIT                     ((uint32_t)0x00000000U)         /* !< The Controller is in transmit mode. */
#define I2C_MSA_DIR_RECEIVE                      ((uint32_t)0x00000001U)         /* !< The Controller is in receive mode. */
/* I2C_MSA[SADDR] Bits */
#define I2C_MSA_SADDR_OFS                        (1)                             /* !< SADDR Offset */
#define I2C_MSA_SADDR_MASK                       ((uint32_t)0x000007FEU)         /* !< I2C Target Address This field
                                                                                    specifies bits A9 through A0 of the
                                                                                    Target address. In 7-bit addressing
                                                                                    mode as selected by MSA.MODE bit, the
                                                                                    top 3 bits are don't care */
#define I2C_MSA_SADDR_MINIMUM                    ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_MSA_SADDR_MAXIMUM                    ((uint32_t)0x000007FEU)         /* !< Highest possible value */
/* I2C_MSA[MMODE] Bits */
#define I2C_MSA_MMODE_OFS                        (15)                            /* !< MMODE Offset */
#define I2C_MSA_MMODE_MASK                       ((uint32_t)0x00008000U)         /* !< This bit selects the adressing mode
                                                                                    to be used in Controller mode When 0,
                                                                                    7-bit addressing is used. When 1,
                                                                                    10-bit addressing is used. */
#define I2C_MSA_MMODE_MODE7                      ((uint32_t)0x00000000U)         /* !< 7-bit addressing mode */
#define I2C_MSA_MMODE_MODE10                     ((uint32_t)0x00008000U)         /* !< 10-bit addressing mode */

