TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_i2c.h
/* I2C_MRXDATA Bits */
/* I2C_MRXDATA[VALUE] Bits */
#define I2C_MRXDATA_VALUE_OFS                    (0)                             /* !< VALUE Offset */
#define I2C_MRXDATA_VALUE_MASK                   ((uint32_t)0x000000FFU)         /* !< Received Data.  This field contains
                                                                                    the last received data. */
#define I2C_MRXDATA_VALUE_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_MRXDATA_VALUE_MAXIMUM                ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* I2C_MTXDATA Bits */
/* I2C_MTXDATA[VALUE] Bits */
#define I2C_MTXDATA_VALUE_OFS                    (0)                             /* !< VALUE Offset */
#define I2C_MTXDATA_VALUE_MASK                   ((uint32_t)0x000000FFU)         /* !< Transmit Data This byte contains
                                                                                    the data to be transferred during the
                                                                                    next transaction. */
#define I2C_MTXDATA_VALUE_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_MTXDATA_VALUE_MAXIMUM                ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* I2C_MTPR Bits */
/* I2C_MTPR[TPR] Bits */
#define I2C_MTPR_TPR_OFS                         (0)                             /* !< TPR Offset */
#define I2C_MTPR_TPR_MASK                        ((uint32_t)0x0000007FU)         /* !< Timer Period  This field is used in
                                                                                    the equation to configure SCL_PERIOD
                                                                                    : SCL_PERIOD = (1 + TPR ) * (SCL_LP +
                                                                                    SCL_HP ) * INT_CLK_PRD where:
                                                                                    SCL_PRD is the SCL line period (I2C
                                                                                    clock).   TPR is the Timer Period
                                                                                    register value (range of 1 to 127).
                                                                                    SCL_LP is the SCL Low period (fixed
                                                                                    at 6).   SCL_HP is the SCL High
                                                                                    period (fixed at 4).   CLK_PRD is the
                                                                                    functional clock period in ns. */
#define I2C_MTPR_TPR_MINIMUM                     ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2C_MTPR_TPR_MAXIMUM                     ((uint32_t)0x0000007FU)         /* !< Highest possible value */

/* I2C_MCR Bits */
/* I2C_MCR[LPBK] Bits */
#define I2C_MCR_LPBK_OFS                         (8)                             /* !< LPBK Offset */
#define I2C_MCR_LPBK_MASK                        ((uint32_t)0x00000100U)         /* !< I2C Loopback */
#define I2C_MCR_LPBK_DISABLE                     ((uint32_t)0x00000000U)         /* !< Normal operation. */
#define I2C_MCR_LPBK_ENABLE                      ((uint32_t)0x00000100U)         /* !< The controller in a test mode
                                                                                    loopback configuration. */
/* I2C_MCR[MMST] Bits */
#define I2C_MCR_MMST_OFS                         (1)                             /* !< MMST Offset */
#define I2C_MCR_MMST_MASK                        ((uint32_t)0x00000002U)         /* !< MultiController mode. In
                                                                                    MultiController mode the SCL high
                                                                                    time counts once the SCL line has
                                                                                    been detected high. If this is not
                                                                                    enabled the high time counts as soon
                                                                                    as the SCL line has been set high by
                                                                                    the I2C controller. */
#define I2C_MCR_MMST_DISABLE                     ((uint32_t)0x00000000U)         /* !< Disable MultiController mode. */
#define I2C_MCR_MMST_ENABLE                      ((uint32_t)0x00000002U)         /* !< Enable MultiController mode. */
/* I2C_MCR[ACTIVE] Bits */
#define I2C_MCR_ACTIVE_OFS                       (0)                             /* !< ACTIVE Offset */
#define I2C_MCR_ACTIVE_MASK                      ((uint32_t)0x00000001U)         /* !< Device Active  After this bit has
                                                                                    been set, it should not be set again
                                                                                    unless it has been cleared by writing
                                                                                    a 0 or by a reset, otherwise transfer
                                                                                    failures may occur. */
#define I2C_MCR_ACTIVE_DISABLE                   ((uint32_t)0x00000000U)         /* !< Disables the I2C Controller
                                                                                    operation. */
#define I2C_MCR_ACTIVE_ENABLE                    ((uint32_t)0x00000001U)         /* !< Enables the I2C Controller
                                                                                    operation. */
/* I2C_MCR[CLKSTRETCH] Bits */
#define I2C_MCR_CLKSTRETCH_OFS                   (2)                             /* !< CLKSTRETCH Offset */
#define I2C_MCR_CLKSTRETCH_MASK                  ((uint32_t)0x00000004U)         /* !< Clock Stretching. This bit controls
                                                                                    the support for clock stretching of
                                                                                    the I2C bus. */
#define I2C_MCR_CLKSTRETCH_DISABLE               ((uint32_t)0x00000000U)         /* !< Disables the clock stretching
                                                                                    detection. This can be disabled if no
                                                                                    Target on the bus does support clock
                                                                                    stretching, so that the maximum speed
                                                                                    on the bus can be reached. */
#define I2C_MCR_CLKSTRETCH_ENABLE                ((uint32_t)0x00000004U)         /* !< Enables the clock stretching
                                                                                    detection. Enabling the clock
                                                                                    stretching ensures compliance to the
                                                                                    I2C standard but could limit the
                                                                                    speed due the clock stretching. */

/* I2C_MBMON Bits */
/* I2C_MBMON[SCL] Bits */
#define I2C_MBMON_SCL_OFS                        (0)                             /* !< SCL Offset */
#define I2C_MBMON_SCL_MASK                       ((uint32_t)0x00000001U)         /* !< I2C SCL Status */
#define I2C_MBMON_SCL_CLEARED                    ((uint32_t)0x00000000U)         /* !< The I2CSCL signal is low. */
#define I2C_MBMON_SCL_SET                        ((uint32_t)0x00000001U)         /* !< The I2CSCL signal is high. Note:
                                                                                    During and right after reset, the SCL
                                                                                    pin is in GPIO input mode without the
                                                                                    internal pull enabled. For proper I2C
                                                                                    operation, the user should have the
                                                                                    external pull-up resistor in place
                                                                                    before starting any I2C operations. */
/* I2C_MBMON[SDA] Bits */
#define I2C_MBMON_SDA_OFS                        (1)                             /* !< SDA Offset */
#define I2C_MBMON_SDA_MASK                       ((uint32_t)0x00000002U)         /* !< I2C SDA Status */
#define I2C_MBMON_SDA_CLEARED                    ((uint32_t)0x00000000U)         /* !< The I2CSDA signal is low. */
#define I2C_MBMON_SDA_SET                        ((uint32_t)0x00000002U)         /* !< The I2CSDA signal is high. Note:
                                                                                    During and right after reset, the SDA
                                                                                    pin is in GPIO input mode without the
                                                                                    internal pull enabled. For proper I2C
                                                                                    operation, the user should have the
                                                                                    external pull-up resistor in place
                                                                                    before starting any I2C operations. */

/* I2C_MFIFOCTL Bits */
/* I2C_MFIFOCTL[TXTRIG] Bits */
#define I2C_MFIFOCTL_TXTRIG_OFS                  (0)                             /* !< TXTRIG Offset */
#define I2C_MFIFOCTL_TXTRIG_MASK                 ((uint32_t)0x00000007U)         /* !< TX FIFO Trigger Indicates at what
                                                                                    fill level in the TX FIFO a trigger
                                                                                    will be generated. */
#define I2C_MFIFOCTL_TXTRIG_EMPTY                ((uint32_t)0x00000000U)         /* !< Trigger when the TX FIFO is empty. */
#define I2C_MFIFOCTL_TXTRIG_LEVEL_1              ((uint32_t)0x00000001U)         /* !< Trigger when TX FIFO contains  1
                                                                                    byte */
#define I2C_MFIFOCTL_TXTRIG_LEVEL_2              ((uint32_t)0x00000002U)         /* !< Trigger when TX FIFO contains  2
                                                                                    byte */
#define I2C_MFIFOCTL_TXTRIG_LEVEL_3              ((uint32_t)0x00000003U)         /* !< Trigger when TX FIFO contains  3
                                                                                    byte */
#define I2C_MFIFOCTL_TXTRIG_LEVEL_4              ((uint32_t)0x00000004U)         /* !< Trigger when TX FIFO contains  4
                                                                                    byte */
#define I2C_MFIFOCTL_TXTRIG_LEVEL_5              ((uint32_t)0x00000005U)         /* !< Trigger when TX FIFO contains  5
                                                                                    byte */
#define I2C_MFIFOCTL_TXTRIG_LEVEL_6              ((uint32_t)0x00000006U)         /* !< Trigger when TX FIFO contains  6
                                                                                    byte */
#define I2C_MFIFOCTL_TXTRIG_LEVEL_7              ((uint32_t)0x00000007U)         /* !< Trigger when TX FIFO contains  7
                                                                                    byte */
/* I2C_MFIFOCTL[TXFLUSH] Bits */
#define I2C_MFIFOCTL_TXFLUSH_OFS                 (7)                             /* !< TXFLUSH Offset */
#define I2C_MFIFOCTL_TXFLUSH_MASK                ((uint32_t)0x00000080U)         /* !< TX FIFO Flush Setting this bit will
                                                                                    Flush the TX FIFO.  Before clearing
                                                                                    this bit to stop Flush the TXFIFOCNT
                                                                                    should be checked to be 8 and
                                                                                    indicating that the Flush has
                                                                                    completed. */
#define I2C_MFIFOCTL_TXFLUSH_NOFLUSH             ((uint32_t)0x00000000U)         /* !< Do not Flush FIFO */
#define I2C_MFIFOCTL_TXFLUSH_FLUSH               ((uint32_t)0x00000080U)         /* !< Flush FIFO */
/* I2C_MFIFOCTL[RXTRIG] Bits */
#define I2C_MFIFOCTL_RXTRIG_OFS                  (8)                             /* !< RXTRIG Offset */
#define I2C_MFIFOCTL_RXTRIG_MASK                 ((uint32_t)0x00000700U)         /* !< RX FIFO Trigger Indicates at what
                                                                                    fill level in the RX FIFO a trigger
                                                                                    will be generated. Note: Programming
                                                                                    RXTRIG to 0x0 has no effect since no
                                                                                    data is present to transfer out of RX
                                                                                    FIFO. */
#define I2C_MFIFOCTL_RXTRIG_LEVEL_1              ((uint32_t)0x00000000U)         /* !< Trigger when RX FIFO contains >= 1
                                                                                    byte */
#define I2C_MFIFOCTL_RXTRIG_LEVEL_2              ((uint32_t)0x00000100U)         /* !< Trigger when RX FIFO contains >= 2
                                                                                    byte */
#define I2C_MFIFOCTL_RXTRIG_LEVEL_3              ((uint32_t)0x00000200U)         /* !< Trigger when RX FIFO contains >= 3
                                                                                    byte */
#define I2C_MFIFOCTL_RXTRIG_LEVEL_4              ((uint32_t)0x00000300U)         /* !< Trigger when RX FIFO contains >= 4
                                                                                    byte */
#define I2C_MFIFOCTL_RXTRIG_LEVEL_5              ((uint32_t)0x00000400U)         /* !< Trigger when RX FIFO contains >= 5
                                                                                    byte */
#define I2C_MFIFOCTL_RXTRIG_LEVEL_6              ((uint32_t)0x00000500U)         /* !< Trigger when RX FIFO contains >= 6
                                                                                    byte */
#define I2C_MFIFOCTL_RXTRIG_LEVEL_7              ((uint32_t)0x00000600U)         /* !< Trigger when RX FIFO contains >= 7
                                                                                    byte */
#define I2C_MFIFOCTL_RXTRIG_LEVEL_8              ((uint32_t)0x00000700U)         /* !< Trigger when RX FIFO contains >= 8
                                                                                    byte */
/* I2C_MFIFOCTL[RXFLUSH] Bits */
#define I2C_MFIFOCTL_RXFLUSH_OFS                 (15)                            /* !< RXFLUSH Offset */
#define I2C_MFIFOCTL_RXFLUSH_MASK                ((uint32_t)0x00008000U)         /* !< RX FIFO Flush Setting this bit will
                                                                                    Flush the RX FIFO. Before clearing
                                                                                    this bit to stop Flush the RXFIFOCNT
                                                                                    should be checked to be 0 and
                                                                                    indicating that the Flush has
                                                                                    completed. */
#define I2C_MFIFOCTL_RXFLUSH_NOFLUSH             ((uint32_t)0x00000000U)         /* !< Do not Flush FIFO */
#define I2C_MFIFOCTL_RXFLUSH_FLUSH               ((uint32_t)0x00008000U)         /* !< Flush FIFO */

